import GriTable from '@/components/tools/griTable'

export default function GRI2() {
  const headers = ['Topic', 'No.', '지표명', '내용']

  const rows = [
    [{value: '조직 및 보고 관행', rowSpan: 5}, '2-1', '조직 세부사항', ''],
    ['2-2', '조직의 지속가능경영보고에 포함된 법인', ''],
    ['2-3', '보고 기간, 주기 및 문의처', ''],
    ['2-4', '정보의 수정', ''],
    ['2-5', '외부 검증', ''],
    [{value: '기업활동 및 임직원', rowSpan: 3}, '2-6', '활동, 가치사슬, 사업 관계', ''],
    ['2-7', '임직원', ''],
    ['2-8', '임직원이 아닌 근로자', ''],
    [{value: '지배구조', rowSpan: 13}, '2-9', '지배 구조 및 구성', ''],
    ['2-10', '최고의사결정기구의 임명 및 선정', ''],
    ['2-11', '최고의사결정기구 의장', ''],
    ['2-12', '영향 관리 감독에 대한 최고의사결정기구의 역할', ''],
    ['2-13', '영향 관리에 대한 책임의 위임', ''],
    ['2-14', '지속가능성 보고에 대한 최고의사결정기구의 역할', ''],
    ['2-15', '이해관계 상충', ''],
    ['2-16', '중요 사안에 대한 커뮤니케이션', ''],
    ['2-17', '최고의사결정기구의 집단지식', ''],
    ['2-18', '최고의사결정기구 성과 평가', ''],
    ['2-19', '보수 정책', ''],
    ['2-20', '보수 결정 절차', ''],
    ['2-21', '연간 총 보상 비율', ''],
    [
      {value: '전략, 정책 및 관행', rowSpan: 7},
      '2-22',
      '지속가능한 개발 전략에 대한 성명서',
      ''
    ],
    ['2-23', '정책 약속', ''],
    ['2-24', '정책 약속 내재', ''],
    ['2-25', '부정적 영향 개선을 위한 프로세스', ''],
    ['2-26', '자문 및 우려 제기에 대한 절차', ''],
    ['2-27', '법률 및 규정에 대한 컴플라이언스', ''],
    ['2-28', '가입 협회', ''],
    [
      {value: '이해관계자 참여', rowSpan: 2},
      '2-29',
      '이해관계자 참여에 대한 접근방식',
      ''
    ],
    ['2-30', '단체협약', '']
  ]

  return (
    <div className="flex flex-col w-full h-full space-y-4">
      <span className="flex justify-center w-full text-xl font-bold">
        GRI 2: 일반 표준(Universal standards)
      </span>
      <GriTable headers={headers} rows={rows} tableId="GRI2" />
    </div>
  )
}
