import GriTable from '@/components/tools/griTable'

export default function GRI200() {
  const headers = ['No.', '지표명', '내용']

  const rows = [
    ['201-1', '직접적인 경제적 가치 창출과 배분', ''],
    ['201-2', '기후변화의 재무적 영향과 사업활동에 대한 위험 및 기회', ''],
    ['201-3', '확정급여제도와 기타 퇴직제도', ''],
    ['201-4', '정부로부터 받은 재정적 지원', ''],
    [
      '202-1',
      '주요 사업장이 위치한 지역의 최저 임금과 비교한 성별 기본 초임 임금 비율',
      ''
    ],
    ['202-2', '주요 사업장이 위치한 현지에서 고용된 고위 경영진의 비율', ''],
    ['203-1', '인프라 투자와 지원 서비스의 개발 및 영향', ''],
    ['203-2', '중요한 간접적 경제 효과', ''],
    ['204-1', '지역 공급업체에서 사용하는 예산 비율', ''],
    ['205-1', '부패 위험을 평가한 사업장의 수 및 비율, 파악된 중요한 위험', ''],
    ['205-2', '반부패 정책 및 절차에 대한 공지와 훈련', ''],
    ['205-3', '확인된 부패 사례와 이에 대한 조치', ''],
    ['206-1', '경쟁저해행위, 독과점 등 불공정 거래행위에 대한 법적 조치', ''],
    ['207-1', '세금에 대한 접근법', ''],
    ['207-2', '조세 거버넌스, 통제 및 리스크 관리', ''],
    ['207-3', '이해관계자 참여 및 세금 문제 관리', '']
  ]

  return (
    <div className="flex flex-col w-full h-full space-y-4">
      <span className="flex justify-center w-full text-xl font-bold">
        Topic specific standards-경제
      </span>
      <GriTable headers={headers} rows={rows} tableId="GRI200" />
    </div>
  )
}
