import GriTable from '@/components/tools/griTable'

export default function GRI300() {
  const headers = ['No.', '지표명', '내용']
  const rows = [
    ['301-1', '사용 원재료의 중량이나 부피', ''],
    ['301-2', '재생 원재료 사용 비율', ''],
    ['301-3', '재생 원료 사용 제품 및 포장재 비율', ''],

    ['302-1', '조직 내부 에너지 사용량', ''],
    ['302-2', '조직 외부 에너지 사용량', ''],
    ['302-3', '에너지 사용량 집약도', ''],
    ['302-4', '에너지 소비 절감', ''],
    ['302-5', '제품 및 서비스의 에너지 감축 필수 요건', ''],

    ['303-1', '공유 자원으로서의 용수 활용', ''],
    ['303-2', '폐수 관련 영향에 대한 관리', ''],
    ['303-3', '용수 취수량', ''],
    ['303-5', '용수 사용량', ''],

    [
      '304-1',
      '생물다양성 가치가 높은 구역 또는 주변지역에 소유, 임대, 관리 중인 사업장',
      ''
    ],
    ['304-2', '활동, 제품, 서비스가 생물다양성에 미치는 중대한 영향', ''],
    ['304-3', '보호 또는 복원된 서식지', ''],
    ['304-4', '영향 지역에 서식하는 IUCN 적색목록 종과 국가보호종', ''],

    ['305-1', '직접 온실가스 배출량(Scope 1)', ''],
    ['305-2', '간접 온실가스 배출량(Scope 2)', ''],
    ['305-3', '기타 간접 온실가스 배출량(Scope 3)', ''],
    ['305-4', '온실가스 배출량 집약도', ''],
    ['305-5', '온실가스 배출량 감축', ''],
    ['305-6', '오존층 파괴 물질(ODS) 배출량', ''],
    ['305-7', '대기오염물질 배출량(NOx, SOx 등)', ''],

    ['306-1', '폐기물 발생 및 주요 사항', ''],
    ['306-2', '폐기물 관련 주요 영향 관리', ''],
    ['306-3', '폐기물 발생량 및 종류', ''],
    ['306-4', '폐기물 재활용 현황', ''],
    ['306-5', '기타 폐기물 처리 현황(에너지 회수 여부)', ''],

    ['308-1', '환경 기준 심사를 거친 신규 공급업체', ''],
    ['308-2', '공급망 내 부정적 환경 영향 및 조치', ''],

    ['307-1', '환경규제 위반', '']
  ]

  return (
    <div className="flex flex-col w-full h-full space-y-4">
      <span className="flex justify-center w-full text-xl font-bold">
        Topic specific standards-환경
      </span>
      <GriTable headers={headers} rows={rows} tableId="GRI300" />
    </div>
  )
}
