import GriTable from '@/components/tools/griTable'

export default function GRI400() {
  const headers = ['No.', '지표명', '내용']

  const rows = [
    ['401-1', '신규채용자 수 및 이직자 현황', ''],
    ['401-2', '임직원 복리후생 제도', ''],
    ['401-3', '육아휴직 사용, 복귀, 유지', ''],

    ['402-1', '운영상 변경내용 최소 통지 기간', ''],

    ['403-1', '안전보건경영시스템 구축', ''],
    ['403-2', '안전보건 위험성 평가, 산업재해 조사', ''],
    ['403-3', '안전보건 개선 활동', ''],
    ['403-4', '근로자 대상 안전보건 커뮤니케이션', ''],
    ['403-5', '근로자 대상 안전보건 교육 및 훈련', ''],
    ['403-6', '근로자 건강증진 프로그램', ''],
    ['403-7', '사업운영과 직결된 안전보건 영향 예방 및 완화', ''],
    ['403-8', '안전보건경영시스템 적용 대상 근로자', ''],
    ['403-9', '임직원, 협력사 재해 및 부상발생 현황', ''],
    ['403-10', '임직원, 협력사 질병발생 현황', ''],

    ['404-1', '임직원 1인당 평균 교육 시간', ''],
    ['404-2', '임직원 역량 강화 및 전환 지원을 위한 프로그램', ''],
    ['404-3', '업무성과 및 경력개발에 대한 정기적 피드백 비율', ''],

    ['405-1', '범주별 거버넌스 기구 및 근로자 구성', ''],
    ['405-2', '남성 대비 여성의 기본급 및 보상 비율', ''],

    ['406-1', '차별 사건 및 이에 대한 조치', ''],

    ['407-1', '결사 및 단체교섭의 자유 침해 위험 사업장', ''],

    ['408-1', '아동 노동 발생 위험이 높은 사업장', ''],
    ['409-1', '강제 노동 발생 위험이 높은 사업장', ''],

    ['410-1', '보안 담당자의 인권 교육', ''],

    ['411-1', '원주민 권리 침해 사건 수', ''],

    ['412-1', '인권영향 평가 혹은 검토대상 사업장', ''],
    ['412-2', '임직원 인권 교육', ''],

    ['413-1', '지역사회 참여 및 평가 프로그램 사업장', ''],
    ['413-2', '부정적 영향을 미치는 사업장', ''],

    ['414-1', '심사를 거친 신규 공급업체', ''],
    ['414-2', '부정적 사회 영향 및 조치', ''],

    ['415-1', '정치자금 기부 내역', ''],

    ['416-1', '제품 및 서비스 안전보건 영향평가', ''],
    ['416-2', '안전보건 영향 관련 규정 위반 사건', ''],

    ['417-1', '제품 정보 및 라벨링 내용', ''],
    ['417-2', '라벨링 관련 법규 위반', ''],
    ['417-3', '마케팅 관련 규정 위반', ''],

    ['418-1', '개인정보보호 위반 및 불만 건수', ''],

    ['419-1', '사회·경제적 법규 위반', '']
  ]

  return (
    <div className="flex flex-col w-full h-full space-y-4">
      <span className="flex justify-center w-full text-xl font-bold">
        Topic specific standards-사회
      </span>
      <GriTable headers={headers} rows={rows} tableId="GRI400" />
    </div>
  )
}
